In [7]:
import pandas as pd
import numpy as np

In [21]:
df = pd.read_csv('./bert/glue_data/AuthorClass/train.csv')

In [3]:
#df2 = df.sample(frac=0.1)

In [4]:
df2.to_csv('train_2.csv', index=False)

In [5]:
df2[['text', 'author']]

                                                    text  author
3981   planning thinking and trying go in old directi...       8
42565  ve got out of the habit of lying to you old ma...      39
38573  moment how earnestly i pray that you may be a ...      37
29230  travelled in the same look and hue a short pau...      26
49670  true returned her father again agitated in spi...      45
...                                                  ...     ...
30325  are paying miss no great compliment i think ma...      26
52534  world to tell the private truth cares but litt...      48
19709  without let us pass friend or we shall not be ...      18
46582  local and life it was a low building of red br...      43
50501  had somehow got twisted around and was perched...      46

[5368 rows x 2 columns]

In [20]:
sorted(df['author'].value_counts()[0:20].index.values)

[4, 8, 9, 14, 15, 18, 19, 21, 25, 26, 30, 33, 37, 38, 39, 42, 43, 45, 48, 50]

In [18]:
df['a']

18

In [22]:
df['author'].value_counts()

8     6914
26    4441
14    2696
37    2387
45    2312
21    2307
39    2266
48    1825
33    1742
19    1543
4     1483
15    1460
43    1266
38    1163
25    1159
9     1108
18    1078
42    1022
30     972
50     914
1      912
41     911
28     823
10     755
32     703
36     693
17     660
35     659
29     645
12     627
46     605
20     587
22     495
13     485
44     468
23     455
34     453
40     430
6      407
11     383
2      382
24     380
27     306
3      213
16     183
Name: author, dtype: int64

In [30]:
val = df['author'].value_counts()[20:].index.values

In [32]:
val

array([ 1, 41, 28, 10, 32, 36, 17, 35, 29, 12, 46, 20, 22, 13, 44, 23, 34,
       40,  6, 11,  2, 24, 27,  3, 16])

In [36]:
mask = df['author'].isin([1, 41, 28, 10, 32, 36, 17, 35, 29, 12, 46, 20, 22, 13, 44, 23, 34,
       40,  6, 11,  2, 24, 27,  3, 16])

In [41]:
df[mask]['author'].value_counts()

1     912
41    911
28    823
10    755
32    703
36    693
17    660
35    659
29    645
12    627
46    605
20    587
22    495
13    485
44    468
23    455
34    453
40    430
6     407
11    383
2     382
24    380
27    306
3     213
16    183
Name: author, dtype: int64

In [67]:
def separate(group):
    sample = group.sample(105)
    return sample

def separate_train(group):
    sample = group[100:]
    return sample

def separate_test(group):
    sample = group[0:100]
    return sample

In [62]:
df[mask].head()

                                                text  author
0  ou have time to listen i will give you the ent...       1
1  wish for solitude he was twenty years of age a...       1
2  and the skirt blew in perfect freedom about th...       1
3  of san and the rows of shops opposite impresse...       1
4  an hour s walk was as tiresome as three in a s...       1

In [63]:
separated_df = df.groupby('author').apply(separate)

In [65]:
separated_df['author'].value_counts()

43    105
41    105
33    105
29    105
25    105
21    105
17    105
13    105
9     105
1     105
48    105
44    105
40    105
36    105
32    105
28    105
24    105
20    105
16    105
12    105
8     105
37    105
45    105
39    105
2     105
35    105
27    105
23    105
19    105
15    105
11    105
3     105
50    105
46    105
42    105
38    105
34    105
30    105
26    105
22    105
18    105
14    105
10    105
6     105
4     105
Name: author, dtype: int64

In [74]:
separated_df

                                                           text  author
author
1      575    could not get the music of them out of his min...       1
       518    suggestion she had heard would have sounded fr...       1
       784    this lady is that what i am given to understan...       1
       52     behind him he answered you play a very silly c...       1
       43     true the improvement was but slight but at lea...       1
...                                                         ...     ...
50     52805  she accompanied her words by a flood of tears ...      50
       53576  will leave him reading with eagerness and whil...      50
       53423  the breast floating is properly a transition f...      50
       53565  way nobody him but himself let us help him i e...      50
       53389  he ia dead it is not fifteen minutes he was wi...      50

[4725 rows x 2 columns]

In [76]:
separated_df.reset_index(drop=True)

                                                   text  author
0     could not get the music of them out of his min...       1
1     suggestion she had heard would have sounded fr...       1
2     this lady is that what i am given to understan...       1
3     behind him he answered you play a very silly c...       1
4     true the improvement was but slight but at lea...       1
...                                                 ...     ...
4720  she accompanied her words by a flood of tears ...      50
4721  will leave him reading with eagerness and whil...      50
4722  the breast floating is properly a transition f...      50
4723  way nobody him but himself let us help him i e...      50
4724  he ia dead it is not fifteen minutes he was wi...      50

[4725 rows x 2 columns]

In [88]:
train_df = separated_df.reset_index(drop=True).groupby('author').apply(separate_train)

In [89]:
test_df = separated_df.reset_index(drop=True).groupby('author').apply(separate_test)

In [91]:
train_df.reset_index(drop=True).to_csv('few_shot_train.csv', index=False)
test_df.reset_index(drop=True).to_csv('few_shot_test.csv',index=False)